jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/fcr.h
/*
 * Component description for FCR
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-07-31T17:51:00Z */
#ifndef _PIC32CZCA90_FCR_COMPONENT_H_
#define _PIC32CZCA90_FCR_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FCR                                          */
/* ************************************************************************** */

/* -------- FCR_CTRLA : (FCR Offset: 0x00) (R/W 32) Control A Register -------- */
#define FCR_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCR_CTRLA) Control A Register  Reset Value */

#define FCR_CTRLA_ARB_Pos                     _UINT32_(2)                                          /* (FCR_CTRLA) AHB Arbitration scheme Position */
#define FCR_CTRLA_ARB_Msk                     (_UINT32_(0x1) << FCR_CTRLA_ARB_Pos)                 /* (FCR_CTRLA) AHB Arbitration scheme Mask */
#define FCR_CTRLA_ARB(value)                  (FCR_CTRLA_ARB_Msk & (_UINT32_(value) << FCR_CTRLA_ARB_Pos)) /* Assigment of value for ARB in the FCR_CTRLA register */
#define FCR_CTRLA_FWS_Pos                     _UINT32_(8)                                          /* (FCR_CTRLA) Flash Access Time Defined in terms of AHB Clock Wait States Position */
#define FCR_CTRLA_FWS_Msk                     (_UINT32_(0xF) << FCR_CTRLA_FWS_Pos)                 /* (FCR_CTRLA) Flash Access Time Defined in terms of AHB Clock Wait States Mask */
#define FCR_CTRLA_FWS(value)                  (FCR_CTRLA_FWS_Msk & (_UINT32_(value) << FCR_CTRLA_FWS_Pos)) /* Assigment of value for FWS in the FCR_CTRLA register */
#define FCR_CTRLA_ADRWS_Pos                   _UINT32_(14)                                         /* (FCR_CTRLA) Address Wait State Enable Position */
#define FCR_CTRLA_ADRWS_Msk                   (_UINT32_(0x1) << FCR_CTRLA_ADRWS_Pos)               /* (FCR_CTRLA) Address Wait State Enable Mask */
#define FCR_CTRLA_ADRWS(value)                (FCR_CTRLA_ADRWS_Msk & (_UINT32_(value) << FCR_CTRLA_ADRWS_Pos)) /* Assigment of value for ADRWS in the FCR_CTRLA register */
#define FCR_CTRLA_AUTOWS_Pos                  _UINT32_(15)                                         /* (FCR_CTRLA) Automatic Wait State Enable. Position */
#define FCR_CTRLA_AUTOWS_Msk                  (_UINT32_(0x1) << FCR_CTRLA_AUTOWS_Pos)              /* (FCR_CTRLA) Automatic Wait State Enable. Mask */
#define FCR_CTRLA_AUTOWS(value)               (FCR_CTRLA_AUTOWS_Msk & (_UINT32_(value) << FCR_CTRLA_AUTOWS_Pos)) /* Assigment of value for AUTOWS in the FCR_CTRLA register */
#define FCR_CTRLA_RDBUFWS_Pos                 _UINT32_(16)                                         /* (FCR_CTRLA) Data returned from the Read Buffer match the Flash Wait States Position */
#define FCR_CTRLA_RDBUFWS_Msk                 (_UINT32_(0xF) << FCR_CTRLA_RDBUFWS_Pos)             /* (FCR_CTRLA) Data returned from the Read Buffer match the Flash Wait States Mask */
#define FCR_CTRLA_RDBUFWS(value)              (FCR_CTRLA_RDBUFWS_Msk & (_UINT32_(value) << FCR_CTRLA_RDBUFWS_Pos)) /* Assigment of value for RDBUFWS in the FCR_CTRLA register */
#define FCR_CTRLA_Msk                         _UINT32_(0x000FCF04)                                 /* (FCR_CTRLA) Register Mask  */


/* -------- FCR_CTRLB : (FCR Offset: 0x04) (R/W 32) Control B Register -------- */
#define FCR_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCR_CTRLB) Control B Register  Reset Value */

#define FCR_CTRLB_PRM_Pos                     _UINT32_(0)                                          /* (FCR_CTRLB) Set NVM Power Reduction Mode Position */
#define FCR_CTRLB_PRM_Msk                     (_UINT32_(0x1) << FCR_CTRLB_PRM_Pos)                 /* (FCR_CTRLB) Set NVM Power Reduction Mode Mask */
#define FCR_CTRLB_PRM(value)                  (FCR_CTRLB_PRM_Msk & (_UINT32_(value) << FCR_CTRLB_PRM_Pos)) /* Assigment of value for PRM in the FCR_CTRLB register */
#define FCR_CTRLB_TEMP_Pos                    _UINT32_(1)                                          /* (FCR_CTRLB) NVM Operating Temperature Read Mode Position */
#define FCR_CTRLB_TEMP_Msk                    (_UINT32_(0x1) << FCR_CTRLB_TEMP_Pos)                /* (FCR_CTRLB) NVM Operating Temperature Read Mode Mask */
#define FCR_CTRLB_TEMP(value)                 (FCR_CTRLB_TEMP_Msk & (_UINT32_(value) << FCR_CTRLB_TEMP_Pos)) /* Assigment of value for TEMP in the FCR_CTRLB register */
#define FCR_CTRLB_SLP_Pos                     _UINT32_(8)                                          /* (FCR_CTRLB) NVM Power Reduction Mode selection during System Standby Sleep Position */
#define FCR_CTRLB_SLP_Msk                     (_UINT32_(0x3) << FCR_CTRLB_SLP_Pos)                 /* (FCR_CTRLB) NVM Power Reduction Mode selection during System Standby Sleep Mask */
#define FCR_CTRLB_SLP(value)                  (FCR_CTRLB_SLP_Msk & (_UINT32_(value) << FCR_CTRLB_SLP_Pos)) /* Assigment of value for SLP in the FCR_CTRLB register */
#define FCR_CTRLB_Msk                         _UINT32_(0x00000303)                                 /* (FCR_CTRLB) Register Mask  */


/* -------- FCR_INTENCLR : (FCR Offset: 0x08) (R/W 32) Interrupt Enable Clear Register -------- */
#define FCR_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_INTENCLR) Interrupt Enable Clear Register  Reset Value */

